# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [30]:
#Write your code here
import pandas as pd 

df_Chinese_SM = pd.read_csv("Data/Purchase_Data.csv")
df_Chinese_SM.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [31]:
#Write your code here
df_Chinese_SM.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [34]:
#Write you code here
result_1 = df_Chinese_SM.loc[ :, :"invoice_time"]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [37]:
#Write you code here
result_2 = df_Chinese_SM.loc[: 1]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [44]:
#Write your code here
result_3 = df_Chinese_SM.iloc[:4,:5]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [47]:
#Write your code here
result_4 = df_Chinese_SM.loc[[0,4,6],["invoice_time","price"]]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [48]:
#Write your code here
num_rows = df_Chinese_SM.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [52]:
#Write your code here
df_Chinese_SM.iloc[num_rows -1]

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [54]:
#Write your code here
avg_price = df_Chinese_SM['price'].mean()
max_price = df_Chinese_SM['price'].max()

print("Average price charged:", avg_price)
print("Maximum price charged:", max_price)

Average price charged: 3.1920522110741363
Maximum price charged: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [55]:
#Write you code here
avg_price, avg_num_items = df_Chinese_SM[['price', 'num_item']].mean()

print("Average price:", avg_price)
print("Average number of items purchased:", avg_num_items)

Average price: 3.1920522110741363
Average number of items purchased: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [56]:
#Write your code here
df_Chinese_SM['total'] = df_Chinese_SM['price'] * df_Chinese_SM['num_item']
df_Chinese_SM

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0
...,...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0,4.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0,2.0

What is the avgerage price of the three most expensive purchases?

In [57]:
#Write your code here
sorted_df = df_Chinese_SM.sort_values(by='price', ascending=False)

top_three_expensive = sorted_df.head(3)

avg_price_top_three = top_three_expensive['price'].mean()

print("Average price of the three most expensive purchases:", avg_price_top_three)

Average price of the three most expensive purchases: 6.003333333333333

How many different products are there?

In [58]:
#Write your code here
num_unique_products = df_Chinese_SM['product_id'].nunique()
print("Number of different products:", num_unique_products)

Number of different products: 53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [60]:
#Write your code here
total_stats = df_Chinese_SM['total'].describe()

mean_total = total_stats['mean']
median_total = total_stats['50%'] 

difference = mean_total - median_total

print("Difference between mean and median of the column 'total':", difference)

Difference between mean and median of the column 'total': 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [62]:
#Write your code here
df_data = df_Chinese_SM.drop('total', axis=1)
print(df_data)

      invoice_number   invoice_time store_id  product_id  category_id  \
0       2.020000e+11  7/15/15 10:45     G816     7000300       210101
1       2.020000e+11  7/15/15 12:16     G816     7070884        70203
2       2.020000e+11  7/15/15 12:16     G816     7070884        70203
3       2.020000e+11  7/15/15 12:16     G816     7070891        70401
4       2.020000e+11  7/15/15 12:16     G816     7090363        70401
...              ...            ...      ...         ...          ...
5377    2.020000e+11   9/5/15 23:07      300     7308017       210101
5378    2.020000e+11   9/5/15 23:23     G619     7070891        70401
5379    2.020000e+11   9/5/15 23:24     G619     7071096        70201
5380    2.020000e+11   9/5/15 23:32     G619    15000231        70301
5381    2.020000e+11   9/5/15 23:38     G619    23030206       210101

      num_item  price
0          1.0    2.0
1          1.0    2.0
2          1.0    2.0
3          1.0    6.0
4          1.0    6.0
...        ...    ...
5377       1.0    3.0
5378       1.0    6.0
5379       1.0    5.0
5380       2.0    2.0
5381       1.0    2.0

[5382 rows x 7 columns]

Let's dig a little deeper into the data set and answer some basic question.

In [1]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [64]:
#Write your code here
df_Chinese_SM['invoice_time'] = pd.to_datetime(df_Chinese_SM['invoice_time'])

print(df_Chinese_SM.dtypes)

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
total                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [65]:
#Write your code here
df_Chinese_SM['DOW'] = df_Chinese_SM['invoice_time'].dt.weekday


df_Chinese_SM['Month'] = df_Chinese_SM['invoice_time'].dt.month


print(df_Chinese_SM.head())

   invoice_number        invoice_time store_id  product_id  category_id  \
0    2.020000e+11 2015-07-15 10:45:00     G816     7000300       210101
1    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
2    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
3    2.020000e+11 2015-07-15 12:16:00     G816     7070891        70401
4    2.020000e+11 2015-07-15 12:16:00     G816     7090363        70401

   num_item  price  total  DOW  Month
0       1.0    2.0    2.0    2      7
1       1.0    2.0    2.0    2      7
2       1.0    2.0    2.0    2      7
3       1.0    6.0    6.0    2      7
4       1.0    6.0    6.0    2      7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [3]:
#Write your code here

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [1]:
#Write your code here
import pandas as pd 

df = pd.read_csv("Data/Titanic.csv", header = 0)
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [2]:
#Write your code here
df.columns

df.rename(columns={"Name":"Passenger_Name", "Ticket":"Ticket_Num"}, inplace=True)

df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [4]:
#Write your code here
df.set_index("PassengerId", inplace = True)

df.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [5]:
#Write your code here
df.loc[896,'Passenger_Name']

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [6]:
#Write your code here
df.reset_index(drop=False, inplace=True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [20]:
#Write you code here
missingEntries = df.loc[:,'Age'].isnull().value_counts()
missingEntries[True]

86

Compute the avg age of passengers ignoring the missing data.

In [21]:
#Write your code here
df['Age'].mean()

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [24]:
#Write your code here
df_Age = df['Age']
df_Age.fillna(df_Age.mean())

0      34.50000
1      47.00000
2      62.00000
3      27.00000
4      22.00000
         ...
413    30.27259
414    39.00000
415    38.50000
416    30.27259
417    30.27259
Name: Age, Length: 418, dtype: float64

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [29]:
#Write your code here
df_Age_Oldest = df.sort_values(by = ["Age"], inplace =False, ascending=False).head()
five_Oldest = df_Age_Oldest.head(5)
five_Oldest["Age"].mean()

67.0